# Lab | Pandas

In this lab, we will be working with the customer data from an insurance company, which can be found in the CSV file located at the following link: https://raw.githubusercontent.com/data-bootcamp-v4/data/main/file1.csv

The data includes information such as customer ID, state, gender, education, income, and other variables that can be used to perform various analyses.

Throughout the lab, we will be using the pandas library in Python to manipulate and analyze the data. Pandas is a powerful library that provides various data manipulation and analysis tools, including the ability to load and manipulate data from a variety of sources, including CSV files.

### Data Description

- Customer - Customer ID

- ST - State where customers live

- Gender - Gender of the customer

- Education - Background education of customers 

- Customer Lifetime Value - Customer lifetime value(CLV) is the total revenue the client will derive from their entire relationship with a customer. In other words, is the predicted or calculated value of a customer over their entire duration as a policyholder with the insurance company. It is an estimation of the net profit that the insurance company expects to generate from a customer throughout their relationship with the company. Customer Lifetime Value takes into account factors such as the duration of the customer's policy, premium payments, claim history, renewal likelihood, and potential additional services or products the customer may purchase. It helps insurers assess the long-term profitability and value associated with retaining a particular customer.

- Income - Customers income

- Monthly Premium Auto - Amount of money the customer pays on a monthly basis as a premium for their auto insurance coverage. It represents the recurring cost that the insured person must pay to maintain their insurance policy and receive coverage for potential damages, accidents, or other covered events related to their vehicle.

- Number of Open Complaints - Number of complaints the customer opened

- Policy Type - There are three type of policies in car insurance (Corporate Auto, Personal Auto, and Special Auto)

- Vehicle Class - Type of vehicle classes that customers have Two-Door Car, Four-Door Car SUV, Luxury SUV, Sports Car, and Luxury Car

- Total Claim Amount - the sum of all claims made by the customer. It represents the total monetary value of all approved claims for incidents such as accidents, theft, vandalism, or other covered events.

External Resources: https://towardsdatascience.com/filtering-data-frames-in-pandas-b570b1f834b9

In [2]:
import pandas as pd

In [4]:
cust_data=pd.read_csv('https://raw.githubusercontent.com/data-bootcamp-v4/data/main/file1.csv')

## Challenge 1: Understanding the data

In this challenge, you will use pandas to explore a given dataset. Your task is to gain a deep understanding of the data by analyzing its characteristics, dimensions, and statistical properties.

- Identify the dimensions of the dataset by determining the number of rows and columns it contains.
- Determine the data types of each column and evaluate whether they are appropriate for the nature of the variable. You should also provide suggestions for fixing any incorrect data types.
- Identify the number of unique values for each column and determine which columns appear to be categorical. You should also describe the unique values of each categorical column and the range of values for numerical columns, and give your insights.
- Compute summary statistics such as mean, median, mode, standard deviation, and quartiles to understand the central tendency and distribution of the data for numerical columns. You should also provide your conclusions based on these summary statistics.
- Compute summary statistics for categorical columns and providing your conclusions based on these statistics.

In [7]:
cust_data.shape # to view the number of rows and columns

(4008, 11)

In [47]:
row_count=cust_data.shape[0]
print('row_count',row_count)

row_count 4008

In [8]:
cust_data.head() # to see the column names and some rows to begin to identify the data types

,Customer,ST,GENDER,Education,Customer Lifetime Value,Income,Monthly Premium Auto,Number of Open Complaints,Policy Type,Vehicle Class,Total Claim Amount
0,RB50392,Washington,NaN,Master,NaN,0.0,1000.0,1/0/00,Personal Auto,Four-Door Car,2.704934
1,QZ44356,Arizona,F,Bachelor,697953.59%,0.0,94.0,1/0/00,Personal Auto,Four-Door Car,1131.464935
2,AI49188,Nevada,F,Bachelor,1288743.17%,48767.0,108.0,1/0/00,Personal Auto,Two-Door Car,566.472247
3,WW63253,California,M,Bachelor,764586.18%,0.0,106.0,1/0/00,Corporate Auto,SUV,529.881344
4,GA49547,Washington,M,High School or Below,536307.65%,36357.0,68.0,1/0/00,Personal Auto,Four-Door Car,17.269323

In [9]:
cust_data.dtypes #Cust lifetime value should be foat62; Number open complaints, format unclear. #check data types

Customer                      object
ST                            object
GENDER                        object
Education                     object
Customer Lifetime Value       object
Income                       float64
Monthly Premium Auto         float64
Number of Open Complaints     object
Policy Type                   object
Vehicle Class                 object
Total Claim Amount           float64
dtype: object

################# Data dypes and recommendations

Column name | data type (pandas) | data type (user) | comment or recommendation

Customer                      object: the customer is they Key of this table? It would be recommended to review the null rows and remove them from the dataframe

ST                            object: Categorical | Nominal (no ranking of states is implied)

GENDER                        object: Categorical | Nominal (no ranking of gender is implied)

Education                     object: Categorical | Ordinal

Customer Lifetime Value       object: Numerical | Continuous. It would be recommended to covert to float dtype.

Income                       float64: Numerical | Continuous

Monthly Premium Auto         float64: Numerical | Continuous

Number of Open Complaints     object: Numerical | Discrete (could be continuous as well but as the number is relatively low and an int, discrete seems to apply better). It would be recommended to convert to integer.

Policy Type                   object: Categorical | Nominal (could be ordingal if personal, corporate, and special categories have a implied ranking)

Vehicle Class                 object: Categorical | Ordinal

Total Claim Amount           float64: Numerical | Continuous

In [41]:
#to create a list of object data types for further analysis
object_columns_list=cust_data.select_dtypes(include=["object"]).columns
print(object_columns_list)
print(type(object_columns_list))

Index(['Customer', 'ST', 'GENDER', 'Education', 'Customer Lifetime Value',
       'Number of Open Complaints', 'Policy Type', 'Vehicle Class'],
      dtype='object')
<class 'pandas.core.indexes.base.Index'>

In [32]:
# unique counts of object data type- columns
unique_counts = cust_data[object_columns_list].nunique()
print(unique_counts)

Customer                     1071
ST                              8
GENDER                          5
Education                       6
Customer Lifetime Value      1027
Number of Open Complaints       6
Policy Type                     3
Vehicle Class                   6
dtype: int64

In [77]:
#exploration of categorical series
cust_data[object_columns_list].describe()

,Customer,ST,GENDER,Education,Customer Lifetime Value,Number of Open Complaints,Policy Type,Vehicle Class
count,1071,1071,954,1071,1068,1071,1071,1071
unique,1071,8,5,6,1027,6,3,6
top,RB50392,Oregon,F,Bachelor,445811.34%,1/0/00,Personal Auto,Four-Door Car
freq,1,320,457,324,4,830,780,576

In [76]:
#closer look into customer column it's not clear yet why there are 4000+ records but only 10071 unique customers.
#too many rows, results truncated. Could find a way to view all but that is not the solution.
print(cust_data['Customer'].value_counts())

Customer
RB50392    1
HJ15383    1
AO74776    1
HQ82233    1
OL72737    1
          ..
RO26085    1
ES57969    1
JK55587    1
RN97635    1
MY31220    1
Name: count, Length: 1071, dtype: int64

In [49]:
#ducplicate check on customers
duplicate_cust = cust_data['Customer'].duplicated()
print('duplicate_cust',duplicate_cust)

duplicate_cust 0       False
1       False
2       False
3       False
4       False
        ...
4003     True
4004     True
4005     True
4006     True
4007     True
Name: Customer, Length: 4008, dtype: bool

In [66]:
#is null check on customers
missing_cust = cust_data['Customer'].isnull()
print(('missing_cust',missing_cust))

('missing_cust', 0       False
1       False
2       False
3       False
4       False
        ...
4003     True
4004     True
4005     True
4006     True
4007     True
Name: Customer, Length: 4008, dtype: bool)

In [69]:
missing_cust_list=missing_cust.tolist()

In [74]:
#is null count for customers
missing_cust_count=missing_cust.sum()
print('missing_cust_count', missing_cust_count)

missing_cust_count 2937

In [78]:
#exploration of categorical series
cust_data[object_columns_list_short].describe()

,ST,GENDER,Education,Number of Open Complaints,Policy Type,Vehicle Class
count,1071,954,1071,1071,1071,1071
unique,8,5,6,6,3,6
top,Oregon,F,Bachelor,1/0/00,Personal Auto,Four-Door Car
freq,320,457,324,830,780,576

############## Object series analysis:

ST: the top 4 states reperesent around 80% of the total (oregon, california, arizona, cali). Also errors in data do not allow a an accurate report as there are naming issues like abbreviations.

Gender: almost 48% of the not null records show F as gender. as with ST there is inconsistent naming leading to difficulties in interpreting the numbers

Education: the biggest group is bachelor followed by college and highschool or below. Inconsistent naming also present in this column.

Number of open Complaints: interpreting this series is impossible if the format is not clarified beforehand. format example: 1/0/00. Additionally this column should be treated as a numerical series.

Policy type: the majority of records show a personal auto policy (around 73%) whith a minority showing a corporate one, and some fewer instances of a special policy.

Vehicle class: Four-Door Car is the biggest group with over 50% of the total, followed by two-door caar and SUV which together represent another 38%of the total. The remaining records show Sports Car, luxury SUV and luxury car.

In [40]:
#new object columns list to remove customer and customer lifetime value
object_columns_list_short=['ST', 'GENDER', 'Education',
       'Number of Open Complaints', 'Policy Type', 'Vehicle Class']
print(object_columns_list_short)
print(type(object_columns_list_short))

['ST', 'GENDER', 'Education', 'Number of Open Complaints', 'Policy Type', 'Vehicle Class']
<class 'list'>

In [42]:
#unique values of object columns
for column in object_columns_list_short:
    print(cust_data[column].unique())

['Washington' 'Arizona' 'Nevada' 'California' 'Oregon' 'Cali' 'AZ' 'WA'
 nan]
[nan 'F' 'M' 'Femal' 'Male' 'female']
['Master' 'Bachelor' 'High School or Below' 'College' 'Bachelors' 'Doctor'
 nan]
['1/0/00' '1/2/00' '1/1/00' '1/3/00' '1/5/00' '1/4/00' nan]
['Personal Auto' 'Corporate Auto' 'Special Auto' nan]
['Four-Door Car' 'Two-Door Car' 'SUV' 'Luxury SUV' 'Sports Car'
 'Luxury Car' nan]

In [43]:
#value counts for object columns
for column in object_columns_list_short:
    print(cust_data[column].value_counts())

ST
Oregon        320
California    211
Arizona       186
Cali          120
Nevada         98
Washington     81
WA             30
AZ             25
Name: count, dtype: int64
GENDER
F         457
M         413
Male       39
female     28
Femal      17
Name: count, dtype: int64
Education
Bachelor                324
College                 313
High School or Below    296
Master                   94
Doctor                   37
Bachelors                 7
Name: count, dtype: int64
Number of Open Complaints
1/0/00    830
1/1/00    138
1/2/00     50
1/3/00     34
1/4/00     13
1/5/00      6
Name: count, dtype: int64
Policy Type
Personal Auto     780
Corporate Auto    234
Special Auto       57
Name: count, dtype: int64
Vehicle Class
Four-Door Car    576
Two-Door Car     205
SUV              199
Sports Car        57
Luxury SUV        20
Luxury Car        14
Name: count, dtype: int64

######## Analysis and commentary of numerical series

Income: seems slightly skewed right as the mean is higher than the median and the mode is 0. Min is 0 and Max is 99960. The standard deviation shows high spread of the data (30469 compared to the mean 39296 and the max 99960)

Monthly Premium Auto: shows strong right-skew as the mean (193) is more than double the median (83) and mode (65). Min is 61 and max is 35354. The data shows very high standard deviation (1601) out of a mean of 193 and a max os 35354.

Total Claim Amount: is also skewed right with the mean (404) being higher than median or mode. Standard deviation (293) shows a a medium spread of the data.

In [53]:
#create float columns list. or is it called a pandas.core.index?
float_columns_list=cust_data.select_dtypes(include=["float"]).columns
print(float_columns_list)
print(type(float_columns_list))

Index(['Income', 'Monthly Premium Auto', 'Total Claim Amount'], dtype='object')
<class 'pandas.core.indexes.base.Index'>

In [58]:
#exploration of numerical series
cust_data[float_columns_list].describe()

             Income  Monthly Premium Auto  Total Claim Amount
count   1071.000000           1071.000000         1071.000000
mean   39295.701214            193.234360          404.986909
std    30469.427060           1601.190369          293.027260
min        0.000000             61.000000            0.382107
25%    14072.000000             68.000000          202.157702
50%    36234.000000             83.000000          354.729129
75%    64631.000000            109.500000          532.800000
max    99960.000000          35354.000000         2893.239678

In [62]:
#exploration of numerical series
cust_data[float_columns_list].median()

Income                  36234.000000
Monthly Premium Auto       83.000000
Total Claim Amount        354.729129
dtype: float64

In [63]:
#exploration of numerical series
cust_data[float_columns_list].mode()

   Income  Monthly Premium Auto  Total Claim Amount
0     0.0                  65.0               321.6

In [15]:
cust_data_c=cust_data.copy() #creating a copy to edit the column data types

In [16]:
cust_data_c.columns

Index(['Customer', 'ST', 'GENDER', 'Education', 'Customer Lifetime Value',
       'Income', 'Monthly Premium Auto', 'Number of Open Complaints',
       'Policy Type', 'Vehicle Class', 'Total Claim Amount'],
      dtype='object')

In [21]:
#data cleanup needed, perhaps removal of % symbol. With this commmand it was not possible to change to float dtype.
cust_data_c['Customer Lifetime Value'] = cust_data_c['Customer Lifetime Value'].astype(float)

ValueError: could not convert string to float: '697953.59%'

## Challenge 2: analyzing the data

### Exercise 1

The marketing team wants to know the top 5 less common customer locations. Create a pandas Series object that contains the customer locations and their frequencies, and then retrieve the top 5 less common locations in ascending order.

In [90]:
# Value counts for ST
state_unique_counts = cust_data['ST'].value_counts()
locations_series = pd.Series(state_unique_counts)
print(locations_series)

ST
Oregon        320
California    211
Arizona       186
Cali          120
Nevada         98
Washington     81
WA             30
AZ             25
Name: count, dtype: int64

In [92]:
#create data frame to be able to run other functions
locations_df=pd.DataFrame(locations_series)
locations_df

            count
ST
Oregon        320
California    211
Arizona       186
Cali          120
Nevada         98
Washington     81
WA             30
AZ             25

In [100]:
#using sort_values and head to display the least 5 locations:

locations_df_sorted_head_5=locations_df.sort_values('count').head(5)
locations_df_sorted

            count
ST
AZ             25
WA             30
Washington     81
Nevada         98
Cali          120

### Exercise 2

The sales team wants to know the total number of policies sold for each type of policy. Create a pandas Series object that contains the policy types and their total number of policies sold, and then retrieve the policy type with the highest number of policies sold.

*Hint:*
- *Using value_counts() method simplifies this analysis.*
- *Futhermore, there is a method that returns the index of the maximum value in a column or row.*

In [104]:
# Your code here

policy_counts_df=pd.DataFrame(cust_data['Policy Type'].value_counts())
print(policy_counts_df)

                count
Policy Type
Personal Auto     780
Corporate Auto    234
Special Auto       57

In [105]:
top_policy=policy_counts_df.head(1)
print(top_policy)

               count
Policy Type
Personal Auto    780

### Exercise 3

The sales team wants to know if customers with Personal Auto have a lower income than those with Corporate Auto. How does the average income compare between the two policy types?

- Use *loc* to create two dataframes: one containing only Personal Auto policies and one containing only Corporate Auto policies.
- Calculate the average income for each policy.
- Print the results.

In [117]:
# Select rows with corporate auto policy types using .loc
corp_auto_rows=cust_data.loc[cust_data['Policy Type']=='Corporate Auto',['Customer','Policy Type','Income']]
print(corp_auto_rows)

     Customer     Policy Type   Income
3     WW63253  Corporate Auto      0.0
6     XZ87318  Corporate Auto  55350.0
7     CF85061  Corporate Auto      0.0
8     DY87989  Corporate Auto  14072.0
12    DP39365  Corporate Auto  77026.0
...       ...             ...      ...
1045  WZ31900  Corporate Auto  94389.0
1050  BJ53923  Corporate Auto  51978.0
1052  FB23788  Corporate Auto  86721.0
1056  PI47776  Corporate Auto  89451.0
1059  YG44474  Corporate Auto  54193.0

[234 rows x 3 columns]

In [120]:
# Select rows with personal auto policy types using .loc
personal_auto_rows=cust_data.loc[cust_data['Policy Type']=='Personal Auto',['Customer','Policy Type','Income']]
print(personal_auto_rows)

     Customer    Policy Type   Income
0     RB50392  Personal Auto      0.0
1     QZ44356  Personal Auto      0.0
2     AI49188  Personal Auto  48767.0
4     GA49547  Personal Auto  36357.0
5     OC83172  Personal Auto  62902.0
...       ...            ...      ...
1065  XD85577  Personal Auto  69417.0
1066  TM65736  Personal Auto  38644.0
1067  VJ51327  Personal Auto  63209.0
1068  GS98873  Personal Auto  16061.0
1070  MY31220  Personal Auto  54230.0

[780 rows x 3 columns]

In [126]:
#calculate mean for each policy type
personal_auto_avg=personal_auto_rows['Income'].mean()
corp_auto_avg=corp_auto_rows['Income'].mean()

In [128]:
#print results
print('personal_auto avg.', personal_auto_avg)
print('corp_auto avg.', corp_auto_avg)

personal_auto avg. 38180.69871794872
corp_auto avg. 41390.31196581197

### Bonus: Exercise 4

Your goal is to identify customers with a high policy claim amount.

Instructions:

- Review again the statistics for total claim amount to gain an understanding of the data.
- To identify potential areas for improving customer retention and profitability, we want to focus on customers with a high policy claim amount. Consider customers with a high policy claim amount to be those in the top 25% of the total claim amount. Create a pandas DataFrame object that contains information about customers with a policy claim amount greater than the 75th percentile.
- Use DataFrame methods to calculate summary statistics about the high policy claim amount data.

*Note: When analyzing data, we often want to focus on certain groups of values to gain insights. Percentiles are a useful tool to help us define these groups. A percentile is a measure that tells us what percentage of values in a dataset are below a certain value. For example, the 75th percentile represents the value below which 75% of the data falls. Similarly, the 25th percentile represents the value below which 25% of the data falls. When we talk about the top 25%, we are referring to the values that fall above the 75th percentile, which represent the top quarter of the data. On the other hand, when we talk about the bottom 25%, we are referring to the values that fall below the 25th percentile, which represent the bottom quarter of the data. By focusing on these groups, we can identify patterns and trends that may be useful for making decisions and taking action.*

*Hint: look for a method that gives you the percentile or quantile 0.75 and 0.25 for a Pandas Series.*

*Hint 2: check `Boolean selection according to the values of a single column` in https://towardsdatascience.com/filtering-data-frames-in-pandas-b570b1f834b9*

In [129]:
# Your code here
cust_data['Total Claim Amount'].describe()

count    1071.000000
mean      404.986909
std       293.027260
min         0.382107
25%       202.157702
50%       354.729129
75%       532.800000
max      2893.239678
Name: Total Claim Amount, dtype: float64

In [135]:
# DataFrame.quantile(q=0.5, axis=0, numeric_only=False, interpolation='linear', method='single')

claims_q_25=cust_data['Total Claim Amount'].quantile(q=0.25)
claims_q_50=cust_data['Total Claim Amount'].quantile(q=0.50)
claims_q_75=cust_data['Total Claim Amount'].quantile(q=0.75)

In [136]:
print(claims_q_25,claims_q_50,claims_q_75)

202.157702 354.729129 532.8

In [139]:
rows_q_top_25=cust_data.loc[cust_data['Total Claim Amount']>claims_q_75]
rows_q_top_25

,Customer,ST,GENDER,Education,Customer Lifetime Value,Income,Monthly Premium Auto,Number of Open Complaints,Policy Type,Vehicle Class,Total Claim Amount
1,QZ44356,Arizona,F,Bachelor,697953.59%,0.0,94.0,1/0/00,Personal Auto,Four-Door Car,1131.464935
2,AI49188,Nevada,F,Bachelor,1288743.17%,48767.0,108.0,1/0/00,Personal Auto,Two-Door Car,566.472247
17,OE15005,Cali,NaN,College,394524.16%,28855.0,101.0,1/0/00,Personal Auto,SUV,647.442031
23,TZ98966,Nevada,NaN,Bachelor,245019.10%,0.0,73.0,1/3/00,Corporate Auto,Four-Door Car,554.376763
26,US89481,California,NaN,Bachelor,394637.21%,0.0,111.0,1/0/00,Personal Auto,Four-Door Car,799.200000
...,...,...,...,...,...,...,...,...,...,...,...
1059,YG44474,Oregon,M,College,1401472.13%,54193.0,117.0,1/0/00,Corporate Auto,SUV,720.752945
1061,RY92647,Cali,F,Bachelor,1050677.17%,0.0,92.0,1/0/00,Personal Auto,Four-Door Car,546.524896
1068,GS98873,Arizona,F,Bachelor,323912.47%,16061.0,88.0,1/0/00,Personal Auto,Four-Door Car,633.600000
1069,CW49887,California,F,Master,462680.11%,79487.0,114.0,1/0/00,Special Auto,SUV,547.200000
1070,MY31220,California,F,College,899704.02%,54230.0,112.0,1/0/00,Personal Auto,Two-Door Car,537.600000

In [140]:
rows_q_top_25.describe()

             Income  Monthly Premium Auto  Total Claim Amount
count    264.000000            264.000000          264.000000
mean   23677.344697            165.193182          782.228263
std    27013.483721            623.930992          292.751640
min        0.000000             63.000000          537.600000
25%        0.000000             99.000000          606.521741
50%    18807.000000            114.000000          679.597985
75%    42423.750000            133.250000          851.400000
max    99316.000000          10202.000000         2893.239678

##### Analysis###########

Comparing top 25 percentile of Total Claim Amount to the original table it can be obsered that 
the top vehicle category is SUV in contrast to the top category overall which is Four-Door-Car.  It is suggested to conduct an investigation on the SUV vehicle category and insurance claims.

In [141]:
#exploration of categorical series top 25% customers (per total claim amount)
rows_q_top_25[object_columns_list].describe()

,Customer,ST,GENDER,Education,Customer Lifetime Value,Number of Open Complaints,Policy Type,Vehicle Class
count,264,264,238,264,264,264,264,264
unique,264,7,5,5,256,6,3,6
top,QZ44356,Oregon,F,Bachelor,578018.22%,1/0/00,Personal Auto,SUV
freq,1,90,115,85,3,206,191,101

In [143]:
#exploration of categorical series all customers
cust_data[object_columns_list].describe()

,Customer,ST,GENDER,Education,Customer Lifetime Value,Number of Open Complaints,Policy Type,Vehicle Class
count,1071,1071,954,1071,1068,1071,1071,1071
unique,1071,8,5,6,1027,6,3,6
top,RB50392,Oregon,F,Bachelor,445811.34%,1/0/00,Personal Auto,Four-Door Car
freq,1,320,457,324,4,830,780,576

In [144]:
#value counts for object columns
for column in object_columns_list_short:
    print(rows_q_top_25[column].value_counts())

ST
Oregon        90
California    65
Arizona       40
Nevada        29
Cali          21
WA            10
AZ             9
Name: count, dtype: int64
GENDER
F         115
M         100
Male       16
female      5
Femal       2
Name: count, dtype: int64
Education
Bachelor                85
High School or Below    85
College                 82
Master                   8
Doctor                   4
Name: count, dtype: int64
Number of Open Complaints
1/0/00    206
1/1/00     30
1/3/00     12
1/2/00     11
1/4/00      3
1/5/00      2
Name: count, dtype: int64
Policy Type
Personal Auto     191
Corporate Auto     60
Special Auto       13
Name: count, dtype: int64
Vehicle Class
SUV              101
Four-Door Car     69
Two-Door Car      33
Sports Car        31
Luxury SUV        19
Luxury Car        11
Name: count, dtype: int64